<a href="https://colab.research.google.com/github/Debashis-007/ML-Assignment-02/blob/main/Assignment_02_Encoding.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
import numpy as np

In [ ]:
df = pd.read_csv('Customers.csv')

In [ ]:
df.head()

    age  income  gender m_status buys
0  25.0    high    male   single   no
1  25.0    high    male  married   no
2  35.0    high    male   single  yes
3  35.0  medium    male   single  yes
4  30.0     low  female   single  yes

In [ ]:
df.isnull().sum()

age         2
income      0
gender      0
m_status    1
buys        0
dtype: int64

In [ ]:
fill = df.age.mean()

In [ ]:
fill

28.65

In [ ]:
df.age = df.age.fillna(fill)

In [ ]:
df.isnull().age.sum()

0

In [ ]:
fill2 = df.m_status.mode()

In [ ]:
fill2

0    single
dtype: object

In [ ]:
df.m_status = df.m_status.fillna('fill2')

In [ ]:
df.isnull().m_status.sum()

0

In [ ]:
df.isnull().sum()

age         0
income      0
gender      0
m_status    0
buys        0
dtype: int64

**#Without Encoding Algorithm#**

In [ ]:
df.income.unique()

array(['high', 'medium', 'low'], dtype=object)

In [ ]:
df.gender.unique()

array(['male', 'female'], dtype=object)

In [ ]:
df.m_status.unique()

array(['single', 'married'], dtype=object)

In [ ]:
df.buys.unique()

array(['no', 'yes'], dtype=object)

In [ ]:
df.income = df.income.replace(['high', 'medium', 'low'], [3,2,1])

In [ ]:
df.income.head()

0    3
1    3
2    3
3    2
4    1
Name: income, dtype: int64

In [ ]:
df.gender = df.gender.replace(['male', 'female'], [1,0])

In [ ]:
df.gender.head()

0    1
1    1
2    1
3    1
4    0
Name: gender, dtype: int64

In [ ]:
df.m_status = df.m_status.replace(['single', 'married'], [0,1])

In [ ]:
df.m_status.head()

0    0
1    1
2    0
3    0
4    0
Name: m_status, dtype: int64

In [ ]:
df.buys = df.buys.replace(['no', 'yes'], [0,1])

In [ ]:
df.buys.head()

0    0
1    0
2    1
3    1
4    1
Name: buys, dtype: int64

In [ ]:
df.head()

    age  income  gender  m_status  buys
0  25.0       1       1         0     0
1  25.0       1       1         1     0
2  35.0       1       1         0     1
3  35.0       1       1         0     1
4  30.0       0       0         0     1

**##Label Encoding##**

In [ ]:
df = pd.read_csv('Customers.csv')

In [ ]:
df.head()

    age  income  gender m_status buys
0  25.0    high    male   single   no
1  25.0    high    male  married   no
2  35.0    high    male   single  yes
3  35.0  medium    male   single  yes
4  30.0     low  female   single  yes

In [ ]:
df.isnull().sum()

age         2
income      0
gender      0
m_status    1
buys        0
dtype: int64

In [ ]:
df.age.mean()

28.65

In [ ]:
df.age = df.age.fillna(df.age.mean())

In [ ]:
df.isnull().age.sum()

0

In [ ]:
df.m_status.mode()

0    single
dtype: object

In [ ]:
df.m_status = df.m_status.fillna('single')

In [ ]:
df.isnull().m_status.sum()

0

In [ ]:
df.isnull().sum()

age         0
income      0
gender      0
m_status    0
buys        0
dtype: int64

In [ ]:
from sklearn.preprocessing import LabelEncoder

In [ ]:
le = LabelEncoder()

In [ ]:
for column in df.columns:
  if df[column].dtype == np.number:
    continue
  df[column] = le.fit_transform(df[column])

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: DeprecationWarning: Converting `np.inexact` or `np.floating` to a dtype is deprecated. The current result is `float64` which is not strictly correct.

In [ ]:
df.head()

    age  income  gender  m_status  buys
0  25.0       0       1         1     0
1  25.0       0       1         0     0
2  35.0       0       1         1     1
3  35.0       2       1         1     1
4  30.0       1       0         1     1

**##One-hot Encoding##**

In [ ]:
df = pd.read_csv('Customers.csv')
df.head()

    age  income  gender m_status buys
0  25.0    high    male   single   no
1  25.0    high    male  married   no
2  35.0    high    male   single  yes
3  35.0  medium    male   single  yes
4  30.0     low  female   single  yes

In [ ]:
df.isnull().sum()

age         2
income      0
gender      0
m_status    1
buys        0
dtype: int64

In [ ]:
df.age.mean()

28.65

In [ ]:
df.age = df.age.fillna(28.65)

In [ ]:
df.isnull().age.sum()

0

In [ ]:
df.m_status.mode()

0    single
dtype: object

In [ ]:
df.m_status.mode()

0    single
dtype: object

In [ ]:
df.m_status = df.m_status.fillna('single')

In [ ]:
df.m_status.head()

0     single
1    married
2     single
3     single
4     single
Name: m_status, dtype: object

In [ ]:
df.isnull().sum()

age         0
income      0
gender      0
m_status    0
buys        0
dtype: int64

In [ ]:
dummy = pd.get_dummies(df.income, drop_first=True)

In [ ]:
dummy.head()

   low  medium
0    0       0
1    0       0
2    0       0
3    0       1
4    1       0

In [ ]:
dummy1 = pd.get_dummies(df.gender, drop_first=True)

In [ ]:
dummy1.head()

   male
0     1
1     1
2     1
3     1
4     0

In [ ]:
dummy2 = pd.get_dummies(df.m_status, drop_first=True)

In [ ]:
dummy2.head()

   single
0       1
1       0
2       1
3       1
4       1

In [ ]:
dummy3 = pd.get_dummies(df.buys, drop_first=True)

In [ ]:
dummy3.head()

   yes
0    0
1    0
2    1
3    1
4    1

In [ ]:
df = df.drop('income', axis=1)

In [ ]:
df.head()

    age  gender m_status buys
0  25.0    male   single   no
1  25.0    male  married   no
2  35.0    male   single  yes
3  35.0    male   single  yes
4  30.0  female   single  yes

In [ ]:
df = df.drop('gender', axis=1)

In [ ]:
df = df.drop('m_status', axis=1)

In [ ]:
df = df.drop('buys', axis=1)

In [ ]:
df.head()

    age
0  25.0
1  25.0
2  35.0
3  35.0
4  30.0

In [ ]:
df = pd.concat([df,dummy], axis=1)

In [ ]:
df.head()

    age  low  medium
0  25.0    0       0
1  25.0    0       0
2  35.0    0       0
3  35.0    0       1
4  30.0    1       0

In [ ]:
df = pd.concat([df,dummy1], axis=1)

In [ ]:
df = pd.concat([df,dummy2], axis=1)

In [ ]:
df = pd.concat([df,dummy3], axis=1)

In [ ]:
df.head()

    age  low  medium  male  single  yes
0  25.0    0       0     1       1    0
1  25.0    0       0     1       0    0
2  35.0    0       0     1       1    1
3  35.0    0       1     1       1    1
4  30.0    1       0     0       1    1

**##Ordinal Encoding##**

In [ ]:
df = pd.read_csv('Customers.csv')
df.head()

    age  income  gender m_status buys
0  25.0    high    male   single   no
1  25.0    high    male  married   no
2  35.0    high    male   single  yes
3  35.0  medium    male   single  yes
4  30.0     low  female   single  yes

In [ ]:
df.isnull().sum()

age         2
income      0
gender      0
m_status    1
buys        0
dtype: int64

In [ ]:
df.age.mean()

28.65

In [ ]:
df.age=df.age.fillna(28.65)

In [ ]:
df.m_status.mode()

0    single
dtype: object

In [ ]:
df.m_status=df.m_status.fillna('single')

In [ ]:
df.isnull().sum()

age         0
income      0
gender      0
m_status    0
buys        0
dtype: int64

In [ ]:
df.income.unique()

array(['high', 'medium', 'low'], dtype=object)

In [ ]:
money = ['high', 'medium', 'low']

In [ ]:
from sklearn.preprocessing import OrdinalEncoder

In [ ]:
ordinal1 = OrdinalEncoder(categories= [money])

In [ ]:
encoded =ordinal1.fit_transform(df[['income']])

In [ ]:
new_income = pd.DataFrame(encoded, columns=['income'])

In [ ]:
new_income.head()

   income
0     0.0
1     0.0
2     0.0
3     1.0
4     2.0

In [ ]:
df.gender.unique()

array(['male', 'female'], dtype=object)

In [ ]:
sex = ['male', 'female']

In [ ]:
ordinal2 = OrdinalEncoder(categories = [sex])

In [ ]:
encoded =ordinal2.fit_transform(df[['gender']])

In [ ]:
new_gender = pd.DataFrame(encoded, columns= ['gender'])

In [ ]:
new_gender.head()

   gender
0     0.0
1     0.0
2     0.0
3     0.0
4     1.0

In [ ]:
df.m_status.unique()

array(['single', 'married'], dtype=object)

In [ ]:
couple = ['single', 'married']

In [ ]:
ordinal3 =OrdinalEncoder(categories = [couple])

In [ ]:
encoded = ordinal3.fit_transform(df[['m_status']])

In [ ]:
new_m_status = pd.DataFrame(encoded, columns= ['m_status'])

In [ ]:
new_m_status.head()

   m_status
0       0.0
1       1.0
2       0.0
3       0.0
4       0.0

In [ ]:
df.buys.unique()

array(['no', 'yes'], dtype=object)

In [ ]:
purchase = ['no', 'yes']

In [ ]:
ordinal4 = OrdinalEncoder(categories = [purchase])

In [ ]:
encoded = ordinal4.fit_transform(df[['buys']])

In [ ]:
new_buys = pd.DataFrame(encoded, columns =['buys'])

In [ ]:
new_buys.head()

   buys
0   0.0
1   0.0
2   1.0
3   1.0
4   1.0

In [ ]:
df.income = new_income

In [ ]:
df.head()

    age  income  gender m_status buys
0  25.0     0.0    male   single   no
1  25.0     0.0    male  married   no
2  35.0     0.0    male   single  yes
3  35.0     1.0    male   single  yes
4  30.0     2.0  female   single  yes

In [ ]:
df.gender = new_gender

In [ ]:
df.m_status = new_m_status

In [ ]:
df.buys = new_buys

In [ ]:
df.head()

    age  income  gender  m_status  buys
0  25.0     0.0     0.0       0.0   0.0
1  25.0     0.0     0.0       1.0   0.0
2  35.0     0.0     0.0       0.0   1.0
3  35.0     1.0     0.0       0.0   1.0
4  30.0     2.0     1.0       0.0   1.0

**##Hashing Encoding##**

In [ ]:
df = pd.read_csv('Customers.csv')
df.head()

    age  income  gender m_status buys
0  25.0    high    male   single   no
1  25.0    high    male  married   no
2  35.0    high    male   single  yes
3  35.0  medium    male   single  yes
4  30.0     low  female   single  yes

In [ ]:
df.isnull().sum()

age         2
income      0
gender      0
m_status    1
buys        0
dtype: int64

In [ ]:
df.age.mean()

28.65

In [ ]:
df.age = df.age.fillna(28.65)

In [ ]:
df.m_status.mode()

0    single
dtype: object

In [ ]:
df.m_status = df.m_status.fillna('single')

In [ ]:
df.isnull().sum()

age         0
income      0
gender      0
m_status    0
buys        0
dtype: int64

In [ ]:
!pip install category_encoders

Collecting category_encoders
  Downloading category_encoders-2.2.2-py2.py3-none-any.whl (80 kB)
     || 80 kB 3.9 MB/s
Requirement already satisfied: numpy>=1.14.0 in /usr/local/lib/python3.7/dist-packages (from category_encoders) (1.19.5)
Requirement already satisfied: statsmodels>=0.9.0 in /usr/local/lib/python3.7/dist-packages (from category_encoders) (0.10.2)
Requirement already satisfied: patsy>=0.5.1 in /usr/local/lib/python3.7/dist-packages (from category_encoders) (0.5.1)
Requirement already satisfied: scikit-learn>=0.20.0 in /usr/local/lib/python3.7/dist-packages (from category_encoders) (0.22.2.post1)
Requirement already satisfied: pandas>=0.21.1 in /usr/local/lib/python3.7/dist-packages (from category_encoders) (1.1.5)
Requirement already satisfied: scipy>=1.0.0 in /usr/local/lib/python3.7/dist-packages (from category_encoders) (1.4.1)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas>=0.21.1->category_encoders) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.7/dist-packages (from pandas>=0.21.1->category_encoders) (2018.9)
Requirement already satisfied: six in /usr/local/lib/python3.7/dist-packages (from patsy>=0.5.1->category_encoders) (1.15.0)
Requirement already satisfied: joblib>=0.11 in /usr/local/lib/python3.7/dist-packages (from scikit-learn>=0.20.0->category_encoders) (1.0.1)
Installing collected packages: category-encoders
Successfully installed category-encoders-2.2.2

In [ ]:
import category_encoders as ce

/usr/local/lib/python3.7/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [ ]:
encoder1 = ce.HashingEncoder(cols= 'income', n_components=3)

In [ ]:
enco = encoder1.fit_transform(df)

In [ ]:
encoder2 = ce.HashingEncoder(cols='gender', n_components=2)

In [ ]:
encoder3 =ce.HashingEncoder(cols='m_status', n_components=2)

In [ ]:
encoder4 = ce.HashingEncoder(cols='buys', n_components=2)

In [ ]:
enco = encoder2.fit_transform(df)

In [ ]:
enco = encoder3.fit_transform(df)

In [ ]:
enco = encoder4.fit_transform(df)

In [ ]:
encoder4.fit_transform(df)

/usr/local/lib/python3.7/dist-packages/category_encoders/utils.py:21: FutureWarning: is_categorical is deprecated and will be removed in a future version.  Use is_categorical_dtype instead
  elif pd.api.types.is_categorical(cols):

    col_0  col_1    age  income  gender m_status
0       0      1  25.00    high    male   single
1       0      1  25.00    high    male  married
2       1      0  35.00    high    male   single
3       1      0  35.00  medium    male   single
4       1      0  30.00     low  female   single
5       0      1  32.00     low  female   single
6       1      0  22.00     low  female   single
7       0      1  28.65  medium    male  married
8       1      0  25.00     low  female   single
9       1      0  35.00  medium  female  married
10      1      0  25.00  medium  female   single
11      1      0  35.00  medium    male  married
12      1      0  22.00    high  female   single
13      0      1  35.00  medium    male  married
14      0      1  28.65    high    male   single
15      1      0  25.00    high  female  married
16      1      0  35.00  medium    male  married
17      1      0  22.00    high  female   single
18      1      0  25.00  medium  female  married
19      1      0  30.00    high    male   single
20      0      1  30.00  medium  female  married
21      1      0  25.00     low    male   single

In [ ]:
encoder2.fit_transform(df)

/usr/local/lib/python3.7/dist-packages/category_encoders/utils.py:21: FutureWarning: is_categorical is deprecated and will be removed in a future version.  Use is_categorical_dtype instead
  elif pd.api.types.is_categorical(cols):

    col_0  col_1    age  income m_status buys
0       0      1  25.00    high   single   no
1       0      1  25.00    high  married   no
2       0      1  35.00    high   single  yes
3       0      1  35.00  medium   single  yes
4       0      1  30.00     low   single  yes
5       0      1  32.00     low   single   no
6       0      1  22.00     low   single  yes
7       0      1  28.65  medium  married   no
8       0      1  25.00     low   single  yes
9       0      1  35.00  medium  married  yes
10      0      1  25.00  medium   single  yes
11      0      1  35.00  medium  married  yes
12      0      1  22.00    high   single  yes
13      0      1  35.00  medium  married   no
14      0      1  28.65    high   single   no
15      0      1  25.00    high  married  yes
16      0      1  35.00  medium  married  yes
17      0      1  22.00    high   single  yes
18      0      1  25.00  medium  married  yes
19      0      1  30.00    high   single  yes
20      0      1  30.00  medium  married   no
21      0      1  25.00     low   single  yes

In [ ]:
encoder1.fit_transform(df)

/usr/local/lib/python3.7/dist-packages/category_encoders/utils.py:21: FutureWarning: is_categorical is deprecated and will be removed in a future version.  Use is_categorical_dtype instead
  elif pd.api.types.is_categorical(cols):

    col_0  col_1  col_2    age  gender m_status buys
0       0      1      0  25.00    male   single   no
1       0      1      0  25.00    male  married   no
2       0      1      0  35.00    male   single  yes
3       1      0      0  35.00    male   single  yes
4       1      0      0  30.00  female   single  yes
5       1      0      0  32.00  female   single   no
6       1      0      0  22.00  female   single  yes
7       1      0      0  28.65    male  married   no
8       1      0      0  25.00  female   single  yes
9       1      0      0  35.00  female  married  yes
10      1      0      0  25.00  female   single  yes
11      1      0      0  35.00    male  married  yes
12      0      1      0  22.00  female   single  yes
13      1      0      0  35.00    male  married   no
14      0      1      0  28.65    male   single   no
15      0      1      0  25.00  female  married  yes
16      1      0      0  35.00    male  married  yes
17      0      1      0  22.00  female   single  yes
18      1      0      0  25.00  female  married  yes
19      0      1      0  30.00    male   single  yes
20      1      0      0  30.00  female  married   no
21      1      0      0  25.00    male   single  yes

In [ ]:
encoder3.fit_transform(df)

/usr/local/lib/python3.7/dist-packages/category_encoders/utils.py:21: FutureWarning: is_categorical is deprecated and will be removed in a future version.  Use is_categorical_dtype instead
  elif pd.api.types.is_categorical(cols):

    col_0  col_1    age  income  gender buys
0       1      0  25.00    high    male   no
1       1      0  25.00    high    male   no
2       1      0  35.00    high    male  yes
3       1      0  35.00  medium    male  yes
4       1      0  30.00     low  female  yes
5       1      0  32.00     low  female   no
6       1      0  22.00     low  female  yes
7       1      0  28.65  medium    male   no
8       1      0  25.00     low  female  yes
9       1      0  35.00  medium  female  yes
10      1      0  25.00  medium  female  yes
11      1      0  35.00  medium    male  yes
12      1      0  22.00    high  female  yes
13      1      0  35.00  medium    male   no
14      1      0  28.65    high    male   no
15      1      0  25.00    high  female  yes
16      1      0  35.00  medium    male  yes
17      1      0  22.00    high  female  yes
18      1      0  25.00  medium  female  yes
19      1      0  30.00    high    male  yes
20      1      0  30.00  medium  female   no
21      1      0  25.00     low    male  yes